Documents/РасчетнаяВедомость.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>РасчетнаяВедомость</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОтчетныйПериодС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетныйПериодПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтработаноЧасов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачисленоВсего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдержаноНДФЛ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКВыплате</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТабличныеЗначения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТабельныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>5</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Должность</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оклад</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтработаноЧасов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачисленоВсего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдержаноНДФЛ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКВыплате</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/РасчетнаяВедомость/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ТабличныеЗначенияОкладПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ТабличныеЗначения.ТекущиеДанные;
	СтрокаТабличнойЧасти.НачисленоВсего = СтрокаТабличнойЧасти.Оклад * СтрокаТабличнойЧасти.ОтработаноЧасов;	
КонецПроцедуры

&НаКлиенте
Процедура ТабличныеЗначенияОтработаноЧасовПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ТабличныеЗначения.ТекущиеДанные;
	СтрокаТабличнойЧасти.НачисленоВсего = СтрокаТабличнойЧасти.Оклад * СтрокаТабличнойЧасти.ОтработаноЧасов;
КонецПроцедуры   

&НаКлиенте
Процедура ТабличныеЗначенияУдержаноНДФЛПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.ТабличныеЗначения.ТекущиеДанные;
    СтрокаТабличнойЧасти.СуммаКВыплате = СтрокаТабличнойЧасти.НачисленоВсего - СтрокаТабличнойЧасти.УдержаноНДФЛ;
КонецПроцедуры   

&НаКлиенте
Процедура ТабличныеЗначенияПриИзменении(Элемент)
Объект.ОтработаноЧасов = Объект.ТабличныеЗначения.Итог("ОтработаноЧасов");
Объект.НачисленоВсего = Объект.ТабличныеЗначения.Итог("НачисленоВсего");
Объект.УдержаноНДФЛ = Объект.ТабличныеЗначения.Итог("УдержаноНДФЛ");
Объект.СуммаКВыплате = Объект.ТабличныеЗначения.Итог("СуммаКВыплате");
КонецПроцедуры
